import burjaNaChernomMoreAnimatedMp4 from './burja-na-chernom-more/animated/animated.mp4';
import burjaNaChernomMoreAnimatedWebm from './burja-na-chernom-more/animated/animated.webm';
import burjaNaChernomMorePreview from './burja-na-chernom-more/preview.webp';
import burjaNaChernomMoreAudioGuideMp3 from './burja-na-chernom-more/sounds/audio-guide.mp3';
import burjaNaChernomMoreMusicMp3 from './burja-na-chernom-more/sounds/music.mp3';
import burjaNaChernomMoreSeastormMp3 from './burja-na-chernom-more/sounds/seastorm.mp3';
import danajaAnimatedMp4 from './danaja/animated/animated.mp4';
import danajaAnimatedWebm from './danaja/animated/animated.webm';
import danajaPreview from './danaja/preview.webp';
import danajaAudioGuideMp3 from './danaja/sounds/audio-guide.mp3';
import danajaMusicMp3 from './danaja/sounds/music.mp3';
import elochnyjTorgPreview from './elochnyj-torg/preview.webp';
import elochnyjTorgMagnifier from './elochnyj-torg/magnifier.gif';
import elochnyjTorgMusicMp3 from './elochnyj-torg/sounds/music.mp3';
import trojkaZimojPreview from './trojka-zimoj/preview.webp';
import trojkaZimojSnowstormMp3 from './trojka-zimoj/sounds/snowstorm.mp3';
import trojkaZimojAnimatedVariationFrontMp4 from './trojka-zimoj/animated-variations/front/front.mp4';
import trojkaZimojAnimatedVariationFrontWebm from './trojka-zimoj/animated-variations/front/front.webm';
import trojkaZimojAnimatedVariationLeftMp4 from './trojka-zimoj/animated-variations/left/left.mp4';
import trojkaZimojAnimatedVariationLeftWebm from './trojka-zimoj/animated-variations/left/left.webm';
import trojkaZimojAnimatedVariationRightMp4 from './trojka-zimoj/animated-variations/right/right.mp4';
import trojkaZimojAnimatedVariationRightWebm from './trojka-zimoj/animated-variations/right/right.webm';
import vozvrashhenieSLovliMulejPreview from './vozvrashhenie-s-lovli-mulej/preview.webp';
import vozvrashhenieSLovliMulejMusicMp3 from './vozvrashhenie-s-lovli-mulej/sounds/music.mp3';
import vozvrashhenieSLovliMulejAnimatedVariationCompositionMp4 from './vozvrashhenie-s-lovli-mulej/animated-variations/composition/composition.mp4';
import vozvrashhenieSLovliMulejAnimatedVariationCompositionWebm from './vozvrashhenie-s-lovli-mulej/animated-variations/composition/composition.webm';
import vozvrashhenieSLovliMulejAnimatedVariationDecompositionMp4 from './vozvrashhenie-s-lovli-mulej/animated-variations/decomposition/decomposition.mp4';
import vozvrashhenieSLovliMulejAnimatedVariationDecompositionWebm from './vozvrashhenie-s-lovli-mulej/animated-variations/decomposition/decomposition.webm';
import zhenyIzdaliSmotrjashhieNaGolgofuPreview from './zheny-izdali-smotrjashhie-na-golgofu/preview.webp';
import zhenyIzdaliSmotrjashhieNaGolgofuImageHotspotVideoSkyMp4 from './zheny-izdali-smotrjashhie-na-golgofu/image-hotspot-videos/sky/sky.mp4';
import zhenyIzdaliSmotrjashhieNaGolgofuImageHotspotVideoSkyWebm from './zheny-izdali-smotrjashhie-na-golgofu/image-hotspot-videos/sky/sky.webm';
import zhenyIzdaliSmotrjashhieNaGolgofuImageHotspotVideoMenMp4 from './zheny-izdali-smotrjashhie-na-golgofu/image-hotspot-videos/men/men.mp4';
import zhenyIzdaliSmotrjashhieNaGolgofuImageHotspotVideoMenWebm from './zheny-izdali-smotrjashhie-na-golgofu/image-hotspot-videos/men/men.webm';
import zhenyIzdaliSmotrjashhieNaGolgofuImageHotspotVideoWomenMp4 from './zheny-izdali-smotrjashhie-na-golgofu/image-hotspot-videos/women/women.mp4';
import zhenyIzdaliSmotrjashhieNaGolgofuImageHotspotVideoWomenWebm from './zheny-izdali-smotrjashhie-na-golgofu/image-hotspot-videos/women/women.webm';

const pictures = [
  {
    id: 'burja-na-chernom-more',
    name: '«Буря на Чёрном море»',
    authorAndYear: 'Айвазовский И. К. 1873 г.',
    descriptionParagraphs: [
      'В бурях И. К. Айвазовский видел мощь и завораживающую красоту, поэтому его произведения посвящены водной стихии, которую он изображал во множестве настроений. Метод его работы определили феноменальная память и богатое воображение: он почти не писал с натуры, работая исключительно в мастерской.',
      'Цветовое решение марины «Буря на Чёрном море» построено на тонко разработанной гамме холодных серо-зеленых тонов. Особая виртуозность и артистичность проявляется в ритме распределения тонких и корпусных слоев краски, в динамике и форме мазка, в красоте и сложности фактурных решений, в энергии световых акцентов.',
      'Известно, что в 1844 году Айвазовский пережил бурю в Бискайском заливе, которая наложила отпечаток на его творчество. Шторм был так силен, что судно считали затонувшим, о чем писали в газетах Европы и Петербурга. Так, в данной картине чувствуется страх, перенесенный когда-то самим художником.',
    ],
    preview: burjaNaChernomMorePreview,
    animated: {
      mp4: burjaNaChernomMoreAnimatedMp4,
      webm: burjaNaChernomMoreAnimatedWebm,
    },
    sounds: [
      {
        name: 'Аудиогид',
        icon:
          'data:image/svg+xml,%3Csvg version="1.0" width="80" height="80" xmlns="http://www.w3.org/2000/svg"%3E%3Ccircle style="fill: none; stroke: %23fff; stroke-width: 7.99928; stroke-miterlimit: 4; stroke-dasharray: none; stroke-opacity: 1;" cx="40" cy="40" r="36"/%3E%3Cg style="fill: %23fff;"%3E%3Cpath d="M481.251 280.748c-5.859-5.857-15.357-5.854-21.213.006-5.856 5.859-5.854 15.357.006 21.213C474.202 316.117 482 334.948 482 354.99c0 20.044-7.807 38.881-21.982 53.04-5.861 5.854-5.866 15.352-.012 21.213a14.952 14.952 0 0 0 10.612 4.399c3.836 0 7.673-1.463 10.601-4.388C501.068 409.429 512 383.054 512 354.99c0-28.058-10.92-54.425-30.749-74.242z" style="fill: %23fff;" transform="matrix(.08537 0 0 .08537 18.146 18.146)"/%3E%3Cpath d="M417.606 323.171c-5.858 5.857-5.858 15.355 0 21.213A14.902 14.902 0 0 1 422 354.99c0 4.006-1.561 7.773-4.394 10.606-5.858 5.857-5.858 15.355 0 21.213a14.954 14.954 0 0 0 10.606 4.394c3.838 0 7.678-1.465 10.606-4.394 17.546-17.545 17.546-46.094 0-63.639-5.856-5.857-15.354-5.857-21.212.001zM370 210.458V195c0-102.01-82.99-185-185-185S0 92.99 0 195v23.977c0 56.079 26.024 109.157 70 143.534V487c0 8.284 6.716 15 15 15h180c8.284 0 15-6.716 15-15v-47h45c24.813 0 45-20.187 45-45v-20a15 15 0 0 0-7.05-12.72L343.302 350l19.648-12.28A15 15 0 0 0 370 325v-28.288l28.638-7.16a14.998 14.998 0 0 0 8.843-22.872zm-18.638 59.99A15 15 0 0 0 340 285v31.687l-32.95 20.594a15 15 0 0 0 0 25.44L340 383.313V395c0 8.271-6.729 15-15 15h-60c-8.284 0-15 6.716-15 15v47H100V355c0-4.844-2.34-9.391-6.281-12.206C53.82 314.295 30 268.008 30 218.977V195c0-85.468 69.532-155 155-155s155 69.532 155 155v20c0 2.961.877 5.856 2.52 8.32l28.192 42.29z" style="fill: %23fff;" transform="matrix(.08537 0 0 .08537 18.146 18.146)"/%3E%3Cpath d="M175.403 279.73c-6.864-4.641-16.188-2.84-20.829 4.022-2.866 4.238-6.323 6.645-10.275 7.151-4.974.634-10.837-1.757-16.51-6.742-16.69-14.667-24.775-44.84-17.655-65.888 2.421-7.154 6.302-12.16 10.928-14.095 3.677-1.535 7.874-1.181 12.474 1.057 7.452 3.62 16.427.519 20.05-6.931 3.622-7.45.52-16.427-6.931-20.05-12.331-5.996-25.53-6.619-37.164-1.754-12.689 5.305-22.553 16.726-27.774 32.159-10.959 32.397.58 75.46 26.269 98.036 10.628 9.339 22.773 14.308 34.721 14.308 1.811 0 3.616-.114 5.411-.345 12.509-1.604 23.628-8.743 31.31-20.101 4.638-6.86 2.838-16.185-4.025-20.827z" style="fill: %23fff;" transform="matrix(.08537 0 0 .08537 18.146 18.146)"/%3E%3C/g%3E%3C/svg%3E',
        mp3: burjaNaChernomMoreAudioGuideMp3,
      },
      {
        name: 'Музыка',
        icon:
          'data:image/svg+xml,%3Csvg version="1.0" width="80" height="80" xmlns="http://www.w3.org/2000/svg"%3E%3Ccircle style="fill: none; stroke: %23fff; stroke-width: 7.99928; stroke-miterlimit: 4; stroke-dasharray: none; stroke-opacity: 1;" cx="40" cy="40" r="36"/%3E%3Cpath d="M52.19 45.71c1.306-2.184 2.172-4.946 2.34-7.68.106-1.754-.285-3.596-1.131-5.328-1.328-2.72-3.61-4.248-5.813-5.725-1.645-1.102-3.199-2.142-4.297-3.628l-.197-.265c-.65-.873-1.383-1.862-1.5-2.692-.116-.84-.878-1.438-1.712-1.39a1.611 1.611 0 0 0-1.503 1.61V49.4c-1.353-.821-3.02-1.325-4.846-1.325-4.452 0-8.078 2.898-8.078 6.462 0 3.564 3.626 6.462 8.078 6.462s8.078-2.898 8.078-6.462v-18.83c2.426.927 6.397 3.289 7.49 8.804-.204.3-.398.624-.624.882a1.61 1.61 0 0 0 .145 2.278 1.61 1.61 0 0 0 2.278-.145c.433-.492.817-1.067 1.186-1.668.038-.045.074-.093.106-.148z" style="fill: %23fff; stroke-width: 0.10097;"/%3E%3C/svg%3E',
        mp3: burjaNaChernomMoreMusicMp3,
      },
      {
        name: 'Звуки шторма в море',
        icon:
          'data:image/svg+xml,%3Csvg version="1.0" width="80" height="80" xmlns="http://www.w3.org/2000/svg"%3E%3Ccircle style="fill: none; stroke: %23fff; stroke-width: 7.99928; stroke-miterlimit: 4; stroke-dasharray: none; stroke-opacity: 1;" cx="40" cy="40" r="36"/%3E%3Cg style="fill: %23fff;"%3E%3Cpath d="M423.773 343.871a74.18 74.18 0 0 1-17.241-16.718c-11.494-13.061-26.122-29.257-53.29-29.257-27.167 0-41.273 15.673-53.29 29.78-12.016 14.106-19.853 22.465-37.616 22.465-17.763 0-26.645-9.927-37.616-22.465-10.971-12.539-25.6-29.78-53.29-29.78-27.69 0-41.273 15.673-53.29 29.78-12.016 14.106-19.853 22.465-37.616 22.465-17.763 0-26.645-9.927-37.616-22.465a88.814 88.814 0 0 0-27.69-24.033c-5.194-2.597-11.509-.492-14.106 4.702-2.597 5.194-.492 11.509 4.702 14.106a80.437 80.437 0 0 1 21.42 18.808c12.016 14.106 26.122 29.78 53.29 29.78s41.273-15.673 53.29-29.78c12.016-14.106 19.853-22.465 37.616-22.465 17.763 0 26.645 9.927 37.616 22.465 10.971 12.539 25.6 29.78 53.29 29.78 27.69 0 41.273-15.673 53.29-29.78 12.016-14.106 19.853-22.465 37.616-22.465 17.763 0 26.645 9.927 37.616 22.465a99.769 99.769 0 0 0 21.42 20.375c4.905 3.174 11.455 1.771 14.629-3.135 3.175-4.905 1.772-11.454-3.134-14.628zM423.773 265.503a74.18 74.18 0 0 1-17.241-16.718c-11.494-13.061-26.122-29.257-53.29-29.257-27.167 0-41.273 15.673-53.29 29.78-12.016 14.106-19.853 22.465-37.616 22.465-17.763 0-26.645-9.927-37.616-22.465-10.971-12.539-25.6-29.78-53.29-29.78-27.69 0-41.273 15.673-53.29 29.78-12.016 14.106-19.853 22.465-37.616 22.465-17.763 0-26.645-9.927-37.616-22.465a88.814 88.814 0 0 0-27.69-24.033c-5.194-2.597-11.509-.492-14.106 4.702-2.597 5.194-.492 11.509 4.702 14.106a80.437 80.437 0 0 1 21.42 18.808c12.016 14.106 26.122 29.78 53.29 29.78s41.273-15.673 53.29-29.78c12.016-14.106 19.853-22.465 37.616-22.465 17.763 0 26.645 9.927 37.616 22.465 10.971 12.539 25.6 29.78 53.29 29.78 27.69 0 41.273-15.673 53.29-29.78 12.016-14.106 19.853-22.465 37.616-22.465 17.763 0 26.645 9.927 37.616 22.465a99.769 99.769 0 0 0 21.42 20.375c4.905 3.174 11.455 1.771 14.629-3.135 3.175-4.904 1.772-11.454-3.134-14.628zM423.773 181.911a74.18 74.18 0 0 1-17.241-16.718c-11.494-13.061-26.122-29.257-53.29-29.257-27.167 0-41.273 15.673-53.29 29.78-12.017 14.107-19.853 22.465-37.616 22.465-17.763 0-26.645-9.927-37.616-22.465s-25.6-29.78-53.29-29.78c-27.69 0-41.273 15.673-53.29 29.78-12.016 14.106-19.853 22.465-37.616 22.465-17.763 0-26.645-9.927-37.616-22.465a88.814 88.814 0 0 0-27.69-24.033c-5.194-2.597-11.509-.492-14.106 4.702-2.597 5.194-.492 11.509 4.702 14.106a80.437 80.437 0 0 1 21.42 18.808c12.016 14.106 26.122 29.78 53.29 29.78s41.273-15.673 53.29-29.78c12.016-14.106 19.853-22.465 37.616-22.465 17.763 0 26.645 9.927 37.616 22.465s25.6 29.78 53.29 29.78c27.69 0 41.273-15.673 53.29-29.78 12.017-14.107 19.853-22.465 37.616-22.465 17.763 0 26.645 9.927 37.616 22.465a99.769 99.769 0 0 0 21.42 20.375c4.905 3.174 11.455 1.771 14.629-3.135 3.175-4.904 1.772-11.454-3.134-14.628zM5.814 82.124a80.437 80.437 0 0 1 21.42 18.808c12.016 14.106 26.122 29.78 53.29 29.78s41.273-15.673 53.29-29.78c12.016-14.106 19.853-22.465 37.616-22.465 17.763 0 26.645 9.927 37.616 22.465 10.971 12.539 25.6 29.78 53.29 29.78 27.69 0 41.273-15.673 53.29-29.78 12.016-14.106 19.853-22.465 37.616-22.465 17.763 0 26.645 9.927 37.616 22.465a99.798 99.798 0 0 0 21.42 20.376c4.905 3.174 11.455 1.77 14.629-3.135 3.174-4.905 1.771-11.455-3.135-14.629a74.18 74.18 0 0 1-17.241-16.718c-11.494-13.061-26.122-29.257-53.29-29.257-27.167 0-41.273 15.673-53.29 29.78-12.016 14.106-19.853 22.465-37.616 22.465-17.763 0-26.645-9.927-37.616-22.465-10.971-12.539-25.6-29.78-53.29-29.78-27.69 0-41.273 15.673-53.29 29.78-12.016 14.106-19.853 22.465-37.616 22.465-17.763 0-26.643-9.927-37.615-22.466a88.814 88.814 0 0 0-27.69-24.033c-5.194-2.597-11.509-.492-14.106 4.702-2.597 5.194-.491 11.51 4.702 14.107z" style="fill: %23fff;" transform="matrix(.098 0 0 .098 19 19)"/%3E%3C/g%3E%3C/svg%3E',
        mp3: burjaNaChernomMoreSeastormMp3,
      },
    ],
  },
  {
    id: 'danaja',
    name: '«Даная»',
    authorAndYear:
      'Копия с картины Харменса ван Рейна Рембрандта. Неизвестный русский художник XIX века',
    descriptionParagraphs: [
      'Поступило полотно из коллекции художественных картин иностранной школы Государственного Русского музея в 1927 году. Ранее оно хранилось в собрании Музея Императорской Академии художеств.',
      'Данная картина – редкое произведение копийного характера, получившее широкую известность. В 1985 году подлинная «Даная» получила множественные повреждения в Государственном Эрмитаже. Эксперты долгое время искали что-то похожее на неё и нашли в Омске. В течение реставрации, на протяжении двенадцати лет, картина находилась в Санкт-Петербурге. Уже в 1997 году в Москве удалось показать возрождённый шедевр, а копия вернулась домой.',
      'Даная – дочь Акрисия, легендарного царя Аргоса, и Эвридики (по другим источникам – Аганиппы). Акрисию пророчили смерть от собственного внука, поэтому царь запер свою дочь вместе с кормилицей в медное подземелье (по другой версии – в бронзовую башню), изолировав от внешнего мира. Однако, Зевс настолько был поражен красотой Данаи, что протёк в виде золотого дождя сквозь крышу и проник в лоно Данаи. От этого тайного союза родился Персей, который смертельно ранил своего деда.',
    ],
    preview: danajaPreview,
    animated: {
      mp4: danajaAnimatedMp4,
      webm: danajaAnimatedWebm,
    },
    sounds: [
      {
        name: 'Аудиогид',
        icon:
          'data:image/svg+xml,%3Csvg version="1.0" width="80" height="80" xmlns="http://www.w3.org/2000/svg"%3E%3Ccircle style="fill: none; stroke: %23fff; stroke-width: 7.99928; stroke-miterlimit: 4; stroke-dasharray: none; stroke-opacity: 1;" cx="40" cy="40" r="36"/%3E%3Cg style="fill: %23fff;"%3E%3Cpath d="M481.251 280.748c-5.859-5.857-15.357-5.854-21.213.006-5.856 5.859-5.854 15.357.006 21.213C474.202 316.117 482 334.948 482 354.99c0 20.044-7.807 38.881-21.982 53.04-5.861 5.854-5.866 15.352-.012 21.213a14.952 14.952 0 0 0 10.612 4.399c3.836 0 7.673-1.463 10.601-4.388C501.068 409.429 512 383.054 512 354.99c0-28.058-10.92-54.425-30.749-74.242z" style="fill: %23fff;" transform="matrix(.08537 0 0 .08537 18.146 18.146)"/%3E%3Cpath d="M417.606 323.171c-5.858 5.857-5.858 15.355 0 21.213A14.902 14.902 0 0 1 422 354.99c0 4.006-1.561 7.773-4.394 10.606-5.858 5.857-5.858 15.355 0 21.213a14.954 14.954 0 0 0 10.606 4.394c3.838 0 7.678-1.465 10.606-4.394 17.546-17.545 17.546-46.094 0-63.639-5.856-5.857-15.354-5.857-21.212.001zM370 210.458V195c0-102.01-82.99-185-185-185S0 92.99 0 195v23.977c0 56.079 26.024 109.157 70 143.534V487c0 8.284 6.716 15 15 15h180c8.284 0 15-6.716 15-15v-47h45c24.813 0 45-20.187 45-45v-20a15 15 0 0 0-7.05-12.72L343.302 350l19.648-12.28A15 15 0 0 0 370 325v-28.288l28.638-7.16a14.998 14.998 0 0 0 8.843-22.872zm-18.638 59.99A15 15 0 0 0 340 285v31.687l-32.95 20.594a15 15 0 0 0 0 25.44L340 383.313V395c0 8.271-6.729 15-15 15h-60c-8.284 0-15 6.716-15 15v47H100V355c0-4.844-2.34-9.391-6.281-12.206C53.82 314.295 30 268.008 30 218.977V195c0-85.468 69.532-155 155-155s155 69.532 155 155v20c0 2.961.877 5.856 2.52 8.32l28.192 42.29z" style="fill: %23fff;" transform="matrix(.08537 0 0 .08537 18.146 18.146)"/%3E%3Cpath d="M175.403 279.73c-6.864-4.641-16.188-2.84-20.829 4.022-2.866 4.238-6.323 6.645-10.275 7.151-4.974.634-10.837-1.757-16.51-6.742-16.69-14.667-24.775-44.84-17.655-65.888 2.421-7.154 6.302-12.16 10.928-14.095 3.677-1.535 7.874-1.181 12.474 1.057 7.452 3.62 16.427.519 20.05-6.931 3.622-7.45.52-16.427-6.931-20.05-12.331-5.996-25.53-6.619-37.164-1.754-12.689 5.305-22.553 16.726-27.774 32.159-10.959 32.397.58 75.46 26.269 98.036 10.628 9.339 22.773 14.308 34.721 14.308 1.811 0 3.616-.114 5.411-.345 12.509-1.604 23.628-8.743 31.31-20.101 4.638-6.86 2.838-16.185-4.025-20.827z" style="fill: %23fff;" transform="matrix(.08537 0 0 .08537 18.146 18.146)"/%3E%3C/g%3E%3C/svg%3E',
        mp3: danajaAudioGuideMp3,
      },
      {
        name: 'Музыка',
        icon:
          'data:image/svg+xml,%3Csvg version="1.0" width="80" height="80" xmlns="http://www.w3.org/2000/svg"%3E%3Ccircle style="fill: none; stroke: %23fff; stroke-width: 7.99928; stroke-miterlimit: 4; stroke-dasharray: none; stroke-opacity: 1;" cx="40" cy="40" r="36"/%3E%3Cpath d="M52.19 45.71c1.306-2.184 2.172-4.946 2.34-7.68.106-1.754-.285-3.596-1.131-5.328-1.328-2.72-3.61-4.248-5.813-5.725-1.645-1.102-3.199-2.142-4.297-3.628l-.197-.265c-.65-.873-1.383-1.862-1.5-2.692-.116-.84-.878-1.438-1.712-1.39a1.611 1.611 0 0 0-1.503 1.61V49.4c-1.353-.821-3.02-1.325-4.846-1.325-4.452 0-8.078 2.898-8.078 6.462 0 3.564 3.626 6.462 8.078 6.462s8.078-2.898 8.078-6.462v-18.83c2.426.927 6.397 3.289 7.49 8.804-.204.3-.398.624-.624.882a1.61 1.61 0 0 0 .145 2.278 1.61 1.61 0 0 0 2.278-.145c.433-.492.817-1.067 1.186-1.668.038-.045.074-.093.106-.148z" style="fill: %23fff; stroke-width: 0.10097;"/%3E%3C/svg%3E',
        mp3: danajaMusicMp3,
      },
    ],
  },
  {
    id: 'elochnyj-torg',
    name: '«Ёлочный торг»',
    authorAndYear: 'Манизер Г. М. 1910-е гг.',
    descriptionParagraphs: [
      'В собрании Омского областного музея изобразительных искусств имени М. А. Врубеля есть не только портреты, но и жанровые композиции кисти Генриха Манизера.',
      'Настроение грядущей радости и ожидания праздника художник убедительно передает в жанровой картине «Ёлочный торг», на которой, согласно сведениям сына художника скульптора Матвея Манизера и внучки художника Н. Манизер, изображена рождественская ярмарка на Покровской площади в Санкт-Петербурге. Площадь получила свое название по стоявшей здесь церкви Покрова Пресвятой Богородицы. Вокруг храма ещё в начале XIX века возник толкучий рынок, сохранявший свое назначение до начала XX века. Здесь проходили и рождественские ярмарки. Покровская церковь была разобрана в 1920-х годах, а площадь полностью реконструировали. Был ликвидирован и толкучий рынок, на месте которого создан обширный и уютный сквер. Бывшая Покровская площадь переименована в площадь Тургенева.',
      'Изо всех представленных работ Генриха Манизера эта, пожалуй, является самой атмосферной. Перед зрителем раскинулась городская площадь, на которой торговцы расположили лотки со всевозможными предпраздничными товарами, а центральное место занимает ёлочный базар. Интересно отметить, что работа осталась незавершенной. Это бросается в глаза даже при беглом осмотре: автор с невероятной тщательностью изображает городской пейзаж, зритель может даже разглядеть вывески «Трактир Ярославль» и «Бюро ритуальных услуг», однако лица на переднем плане остались не прописаны. Художник-академист не мог позволить себе такую вольность намеренно. Причины прекращения Г. М. Манизером работы над полотном остаются неизвестными.',
    ],
    preview: elochnyjTorgPreview,
    magnifier: elochnyjTorgMagnifier,
    sounds: [
      {
        name: 'Музыка',
        icon:
          'data:image/svg+xml,%3Csvg version="1.0" width="80" height="80" xmlns="http://www.w3.org/2000/svg"%3E%3Ccircle style="fill: none; stroke: %23fff; stroke-width: 7.99928; stroke-miterlimit: 4; stroke-dasharray: none; stroke-opacity: 1;" cx="40" cy="40" r="36"/%3E%3Cpath d="M52.19 45.71c1.306-2.184 2.172-4.946 2.34-7.68.106-1.754-.285-3.596-1.131-5.328-1.328-2.72-3.61-4.248-5.813-5.725-1.645-1.102-3.199-2.142-4.297-3.628l-.197-.265c-.65-.873-1.383-1.862-1.5-2.692-.116-.84-.878-1.438-1.712-1.39a1.611 1.611 0 0 0-1.503 1.61V49.4c-1.353-.821-3.02-1.325-4.846-1.325-4.452 0-8.078 2.898-8.078 6.462 0 3.564 3.626 6.462 8.078 6.462s8.078-2.898 8.078-6.462v-18.83c2.426.927 6.397 3.289 7.49 8.804-.204.3-.398.624-.624.882a1.61 1.61 0 0 0 .145 2.278 1.61 1.61 0 0 0 2.278-.145c.433-.492.817-1.067 1.186-1.668.038-.045.074-.093.106-.148z" style="fill: %23fff; stroke-width: 0.10097;"/%3E%3C/svg%3E',
        mp3: elochnyjTorgMusicMp3,
      },
    ],
  },
  {
    id: 'trojka-zimoj',
    name: '«Тройка зимой»',
    authorAndYear: 'Сверчков Н. Е. 1888 г.',
    descriptionParagraphs: [
      'Николай Егорович Сверчков (1817-1898) − русский художник-живописец, мастер анималистической, батальной и жанровой живописи.',
      'Тройка Сверчкова бежит по необозримым просторам России, которая славится глубокими сугробами и жестокими буранами. Картина вселяет ужас в душу, становится холодно и зябко при одном только взгляде на человека, направляющего лошадей.',
      'Сверчков умел правдиво и свободно изображать сцены с лошадьми. Именно это и помогло Сверчкову занять место художника Хреновского и Чесменского государственных конных заводов, являющихся крупнейшими в России. В этой должности он создал целую галерею, представляющую породистых лошадей.',
    ],
    preview: trojkaZimojPreview,
    sounds: [
      {
        name: 'Звуки метели',
        icon:
          'data:image/svg+xml,%3Csvg version="1.0" width="80" height="80" xmlns="http://www.w3.org/2000/svg"%3E%3Ccircle style="fill: none; stroke: %23fff; stroke-width: 7.99928; stroke-miterlimit: 4; stroke-dasharray: none; stroke-opacity: 1;" cx="40" cy="40" r="36"/%3E%3Cpath d="M30.75 43.79h18.328c4.931 0 8.943-4.012 8.943-8.943 0-5.452-4.87-9.674-10.308-8.84A8.943 8.943 0 0 0 39.263 20c-5.361 0-9.347 4.7-8.916 9.484-3.76.21-6.755 3.335-6.755 7.147 0 3.948 3.211 7.16 7.159 7.16zm.856-11.658c.89.168 1.671-.61 1.509-1.5-.09-.49-.216-1.338-.216-1.688a6.37 6.37 0 0 1 6.363-6.363c3.068 0 5.7 2.185 6.256 5.196a1.29 1.29 0 0 0 1.655.996c4.098-1.282 8.268 1.792 8.268 6.074a6.37 6.37 0 0 1-6.363 6.363H30.75a4.584 4.584 0 0 1-4.579-4.579c0-2.852 2.6-5.034 5.434-4.499zm-8.38 18.33c0-.712.578-1.29 1.29-1.29h3.416a.958.958 0 0 0 0-1.914 1.29 1.29 0 0 1 0-2.58 3.542 3.542 0 0 1 3.538 3.537 3.542 3.542 0 0 1-3.538 3.538h-3.416a1.29 1.29 0 0 1-1.29-1.29zm14.256 1.291h-3.473a1.29 1.29 0 0 1 0-2.58h3.473a.958.958 0 0 0 0-1.915 1.29 1.29 0 0 1 0-2.58 3.542 3.542 0 0 1 3.538 3.537 3.542 3.542 0 0 1-3.538 3.538zm-.768 4.71A3.542 3.542 0 0 1 33.176 60a1.29 1.29 0 0 1 0-2.58.958.958 0 0 0 0-1.915H22.903a1.29 1.29 0 0 1 0-2.58h10.273a3.542 3.542 0 0 1 3.538 3.537zm5.463-2.43a2.26 2.26 0 0 0-2.258 2.257 2.26 2.26 0 0 0 2.258 2.258 2.26 2.26 0 0 0 2.258-2.258 2.26 2.26 0 0 0-2.258-2.258zm4.84-6.452a2.26 2.26 0 0 0-2.259 2.258 2.26 2.26 0 0 0 2.258 2.258 2.26 2.26 0 0 0 2.258-2.258 2.26 2.26 0 0 0-2.258-2.258zm4.596 5.645a2.26 2.26 0 0 0-2.258 2.258 2.26 2.26 0 0 0 2.258 2.258 2.26 2.26 0 0 0 2.258-2.258 2.26 2.26 0 0 0-2.258-2.258zm4.516-6.452a2.26 2.26 0 0 0-2.258 2.258 2.26 2.26 0 0 0 2.258 2.258 2.26 2.26 0 0 0 2.258-2.258 2.26 2.26 0 0 0-2.258-2.258z" style="fill: %23fff; stroke-width: 0.0806455;"/%3E%3C/svg%3E',
        mp3: trojkaZimojSnowstormMp3,
      },
    ],
    animatedVariations: [
      {
        name: 'Вид спереди',
        icon:
          'data:image/svg+xml,%3Csvg version="1.0" width="80" height="80" xmlns="http://www.w3.org/2000/svg"%3E%3Ccircle style="fill: none; stroke: %23fff; stroke-width: 7.99928; stroke-miterlimit: 4; stroke-dasharray: none; stroke-opacity: 1;" cx="40" cy="40" r="36"/%3E%3Cpath d="M442.627 185.388 265.083 7.844C260.019 2.78 253.263 0 245.915 0c-7.204 0-13.956 2.78-19.02 7.844L49.347 185.388c-10.488 10.492-10.488 27.568 0 38.052l16.12 16.128c5.064 5.06 11.82 7.844 19.028 7.844 7.204 0 14.192-2.784 19.252-7.844l103.808-103.584v329.084c0 14.832 11.616 26.932 26.448 26.932h22.8c14.832 0 27.624-12.1 27.624-26.932V134.816l104.396 104.752c5.06 5.06 11.636 7.844 18.844 7.844 7.208 0 13.864-2.784 18.932-7.844l16.072-16.128c10.492-10.488 10.452-27.56-.044-38.052z" style="fill: %23fff;" transform="matrix(.0752 0 0 .0752 21.5 21.5)"/%3E%3C/svg%3E',
        mp4: trojkaZimojAnimatedVariationFrontMp4,
        webm: trojkaZimojAnimatedVariationFrontWebm,
      },
      {
        name: 'Вид слева',
        icon:
          'data:image/svg+xml,%3Csvg version="1.0" width="80" height="80" xmlns="http://www.w3.org/2000/svg"%3E%3Ccircle style="fill: none; stroke: %23fff; stroke-width: 7.99928; stroke-miterlimit: 4; stroke-dasharray: none; stroke-opacity: 1;" cx="40" cy="40" r="36"/%3E%3Cpath d="M442.627 185.388 265.083 7.844C260.019 2.78 253.263 0 245.915 0c-7.204 0-13.956 2.78-19.02 7.844L49.347 185.388c-10.488 10.492-10.488 27.568 0 38.052l16.12 16.128c5.064 5.06 11.82 7.844 19.028 7.844 7.204 0 14.192-2.784 19.252-7.844l103.808-103.584v329.084c0 14.832 11.616 26.932 26.448 26.932h22.8c14.832 0 27.624-12.1 27.624-26.932V134.816l104.396 104.752c5.06 5.06 11.636 7.844 18.844 7.844 7.208 0 13.864-2.784 18.932-7.844l16.072-16.128c10.492-10.488 10.452-27.56-.044-38.052z" style="fill: %23fff;" transform="matrix(0 .0752 .0752 0 21.5 21.5)"/%3E%3C/svg%3E',
        mp4: trojkaZimojAnimatedVariationLeftMp4,
        webm: trojkaZimojAnimatedVariationLeftWebm,
      },
      {
        name: 'Вид справа',
        icon:
          'data:image/svg+xml,%3Csvg version="1.0" width="80" height="80" xmlns="http://www.w3.org/2000/svg"%3E%3Ccircle style="fill: none; stroke: %23fff; stroke-width: 7.99928; stroke-miterlimit: 4; stroke-dasharray: none; stroke-opacity: 1;" cx="40" cy="40" r="36"/%3E%3Cpath d="M442.627 185.388 265.083 7.844C260.019 2.78 253.263 0 245.915 0c-7.204 0-13.956 2.78-19.02 7.844L49.347 185.388c-10.488 10.492-10.488 27.568 0 38.052l16.12 16.128c5.064 5.06 11.82 7.844 19.028 7.844 7.204 0 14.192-2.784 19.252-7.844l103.808-103.584v329.084c0 14.832 11.616 26.932 26.448 26.932h22.8c14.832 0 27.624-12.1 27.624-26.932V134.816l104.396 104.752c5.06 5.06 11.636 7.844 18.844 7.844 7.208 0 13.864-2.784 18.932-7.844l16.072-16.128c10.492-10.488 10.452-27.56-.044-38.052z" style="fill: %23fff;" transform="matrix(0 .0752 -.0752 0 58.5 21.5)"/%3E%3C/svg%3E',
        mp4: trojkaZimojAnimatedVariationRightMp4,
        webm: trojkaZimojAnimatedVariationRightWebm,
      },
    ],
  },
  {
    id: 'vozvrashhenie-s-lovli-mulej',
    name: '«Возвращение с ловли мулей»',
    authorAndYear: 'Кившенко А. Д. 1881 г.',
    descriptionParagraphs: [
      'Алексей Данилович Кившенко (1851-1895) – академик, профессор Императорской Академии художеств, живописец, изображавший бытовые, охотничьи и батальные сцены. Известность среди широких масс получил после обучения в Европе. Самое узнаваемое полотно – «Возвращение с ловли мулей» – написано в Нормандии. Картина изображает сборщиков мидий после отлива и выстроена в соответствии со строгой композицией с глубоким пространством. На переднем плане – своеобразие северного пейзажа с холодными замшелыми камнями. Чувствуется здесь и психологизм персонажей. В корзинах они несут мидии, или мули. Сбор морских ракушек – одно из важных занятий нормандцев.',
      'Известно, что картина хранилась в фонде Омского музея им. Врубеля. Она стала доступна зрителю после реставрации в 2007 году.',
    ],
    preview: vozvrashhenieSLovliMulejPreview,
    sounds: [
      {
        name: 'Музыка',
        icon:
          'data:image/svg+xml,%3Csvg version="1.0" width="80" height="80" xmlns="http://www.w3.org/2000/svg"%3E%3Ccircle style="fill: none; stroke: %23fff; stroke-width: 7.99928; stroke-miterlimit: 4; stroke-dasharray: none; stroke-opacity: 1;" cx="40" cy="40" r="36"/%3E%3Cpath d="M52.19 45.71c1.306-2.184 2.172-4.946 2.34-7.68.106-1.754-.285-3.596-1.131-5.328-1.328-2.72-3.61-4.248-5.813-5.725-1.645-1.102-3.199-2.142-4.297-3.628l-.197-.265c-.65-.873-1.383-1.862-1.5-2.692-.116-.84-.878-1.438-1.712-1.39a1.611 1.611 0 0 0-1.503 1.61V49.4c-1.353-.821-3.02-1.325-4.846-1.325-4.452 0-8.078 2.898-8.078 6.462 0 3.564 3.626 6.462 8.078 6.462s8.078-2.898 8.078-6.462v-18.83c2.426.927 6.397 3.289 7.49 8.804-.204.3-.398.624-.624.882a1.61 1.61 0 0 0 .145 2.278 1.61 1.61 0 0 0 2.278-.145c.433-.492.817-1.067 1.186-1.668.038-.045.074-.093.106-.148z" style="fill: %23fff; stroke-width: 0.10097;"/%3E%3C/svg%3E',
        mp3: vozvrashhenieSLovliMulejMusicMp3,
      },
    ],
    animatedVariations: [
      {
        name: 'Композиция',
        icon:
          'data:image/svg+xml,%3Csvg version="1.0" width="80" height="80" xmlns="http://www.w3.org/2000/svg"%3E%3Ccircle style="fill: none; stroke: %23fff; stroke-width: 7.99928; stroke-miterlimit: 4; stroke-dasharray: none; stroke-opacity: 1;" cx="40" cy="40" r="36"/%3E%3Cpath d="M31.436 31.435a2.16 2.16 0 0 1-3.062 0l-6.168-6.168-.254 3.13a2.164 2.164 0 0 1-2.334 1.984 2.165 2.165 0 0 1-1.983-2.334l.635-7.797a2.168 2.168 0 0 1 1.981-1.984l7.798-.635a2.168 2.168 0 0 1 2.334 1.985 2.168 2.168 0 0 1-1.982 2.334l-3.129.253 6.168 6.168c.841.848.841 2.22-.004 3.064zM12.454 1.69a2.16 2.16 0 0 0-1.707.627 2.159 2.159 0 0 0-.627 1.354l-.256 3.131L3.698.636A2.163 2.163 0 0 0 .636.634a2.167 2.167 0 0 0 0 3.064l6.166 6.167-3.129.255a2.166 2.166 0 0 0 .352 4.318l7.797-.634a2.168 2.168 0 0 0 1.982-1.985l.635-7.797a2.17 2.17 0 0 0-1.985-2.332zm-.635 16.579-7.797-.636a2.168 2.168 0 0 0-1.707 3.691c.352.35.826.583 1.357.628l3.131.253-6.167 6.169a2.164 2.164 0 0 0 0 3.062 2.16 2.16 0 0 0 3.062 0l6.168-6.166.254 3.128a2.166 2.166 0 0 0 4.318-.351l-.635-7.797a2.168 2.168 0 0 0-1.984-1.981zm8.431-4.464 7.798.635a2.168 2.168 0 0 0 1.707-3.691 2.174 2.174 0 0 0-1.355-.627l-3.131-.255L31.435 3.7A2.165 2.165 0 1 0 28.373.638l-6.166 6.167-.257-3.129a2.166 2.166 0 0 0-4.316.35l.633 7.798a2.167 2.167 0 0 0 1.983 1.981z" style="fill: %23fff;" transform="matrix(1.15365 0 0 1.15365 21.5 21.5)"/%3E%3C/svg%3E',
        mp4: vozvrashhenieSLovliMulejAnimatedVariationCompositionMp4,
        webm: vozvrashhenieSLovliMulejAnimatedVariationCompositionWebm,
      },
      {
        name: 'Декомпозиция',
        icon:
          'data:image/svg+xml,%3Csvg version="1.0" width="80" height="80" xmlns="http://www.w3.org/2000/svg"%3E%3Ccircle style="fill: none; stroke: %23fff; stroke-width: 7.99928; stroke-miterlimit: 4; stroke-dasharray: none; stroke-opacity: 1;" cx="40" cy="40" r="36"/%3E%3Cpath d="M18.72 13.811a2.166 2.166 0 0 1 0-3.063l6.168-6.168-3.131-.254a2.17 2.17 0 0 1-1.984-2.335A2.17 2.17 0 0 1 22.107.008l7.799.635a2.166 2.166 0 0 1 1.982 1.983l.635 7.797a2.166 2.166 0 0 1-4.316.351l-.254-3.129-6.168 6.167a2.165 2.165 0 0 1-3.065-.001zm-7.973 4.908-6.166 6.167-.256-3.13a2.165 2.165 0 0 0-4.318.351l.635 7.8a2.165 2.165 0 0 0 1.984 1.98l7.797.635a2.165 2.165 0 0 0 .352-4.316l-3.131-.256 6.166-6.167a2.162 2.162 0 0 0 .002-3.063 2.165 2.165 0 0 0-3.065-.001zm19.791 1.053a2.153 2.153 0 0 0-1.707.627 2.15 2.15 0 0 0-.627 1.356l-.256 3.13-6.166-6.167a2.164 2.164 0 0 0-3.062 0 2.16 2.16 0 0 0 0 3.063l6.166 6.167-3.132.254a2.168 2.168 0 0 0-1.981 2.335 2.169 2.169 0 0 0 2.337 1.982l7.795-.636a2.166 2.166 0 0 0 1.983-1.981l.633-7.799a2.164 2.164 0 0 0-1.983-2.331zM7.644 4.58l3.131-.254a2.168 2.168 0 0 0 1.982-2.336A2.17 2.17 0 0 0 10.422.007L2.623.643A2.165 2.165 0 0 0 .642 2.626l-.635 7.797a2.166 2.166 0 0 0 4.317.351l.256-3.131 6.168 6.167a2.163 2.163 0 0 0 3.062 0 2.164 2.164 0 0 0 .002-3.063z" style="fill: %23fff;" transform="matrix(1.13742 0 0 1.13742 21.5 21.5)"/%3E%3C/svg%3E',
        mp4: vozvrashhenieSLovliMulejAnimatedVariationDecompositionMp4,
        webm: vozvrashhenieSLovliMulejAnimatedVariationDecompositionWebm,
      },
    ],
  },
  {
    id: 'zheny-izdali-smotrjashhie-na-golgofu',
    name: '«Жёны, издали смотрящие на Голгофу»',
    authorAndYear: 'Боткин М. П. 1867 г.',
    descriptionParagraphs: [
      'М. П. Боткин – академик исторической живописи, гравер, коллекционер, искусствовед и археолог. Был верен канонам академической живописи, то есть утверждал возвышенные и благородные образы библейской истории и античности.',
      'Картина «Жёны, издали смотрящие на Голгофу» создана в Риме в 1867 году. Она посвящена распятию Иисуса Христа на горе Голгофе близ Иерусалима. Художник передает состояние глубокой скорби, охватившей людей. Скорбь, отчаяние, любовь и преданность передается через состояние женщин, сопровождавших Иисуса во время его земного служения. В белом одеянии, по мнению евангелистов, изображена Мария Магдалина, которая приравнена к апостолам.',
      'В конце 60-х годов XIX века работа экспонировалась в залах Петербургской Академии художеств и затем хранилась в мастерской Боткина. В 1925 году дочь художника Е. М. Боткина передала в дар Омскому музею девять произведений отца, среди которых находилась картина «Жёны, издали смотрящие на Голгофу».',
    ],
    preview: zhenyIzdaliSmotrjashhieNaGolgofuPreview,
    imageHotspots: [
      {
        name: 'Небо',
        positionPercentage: {
          x: 243 / 814,
          y: 178 / 582,
        },
        mp4: zhenyIzdaliSmotrjashhieNaGolgofuImageHotspotVideoSkyMp4,
        webm: zhenyIzdaliSmotrjashhieNaGolgofuImageHotspotVideoSkyWebm,
      },
      {
        name: 'Мужчины',
        positionPercentage: {
          x: 128 / 814,
          y: 353 / 582,
        },
        mp4: zhenyIzdaliSmotrjashhieNaGolgofuImageHotspotVideoMenMp4,
        webm: zhenyIzdaliSmotrjashhieNaGolgofuImageHotspotVideoMenWebm,
      },
      {
        name: 'Женщины',
        positionPercentage: {
          x: 541 / 814,
          y: 359 / 582,
        },
        mp4: zhenyIzdaliSmotrjashhieNaGolgofuImageHotspotVideoWomenMp4,
        webm: zhenyIzdaliSmotrjashhieNaGolgofuImageHotspotVideoWomenWebm,
      },
    ],
  },
];

export default pictures;
