import burjaNaChernomMoreAnimatedMp4 from './burja-na-chernom-more/animated/animated.mp4';
import burjaNaChernomMoreAnimatedWebm from './burja-na-chernom-more/animated/animated.webm';
import burjaNaChernomMorePreview from './burja-na-chernom-more/preview.webp';
import burjaNaChernomMoreSpeechIcon from './burja-na-chernom-more/sounds/speech/speech.svg';
import burjaNaChernomMoreSpeechMp3 from './burja-na-chernom-more/sounds/speech/speech.mp3';
import burjaNaChernomMoreMusicIcon from './burja-na-chernom-more/sounds/music/music.svg';
import burjaNaChernomMoreMusicMp3 from './burja-na-chernom-more/sounds/music/music.mp3';
import burjaNaChernomMoreSeaIcon from './burja-na-chernom-more/sounds/sea/sea.svg';
import burjaNaChernomMoreSeaMp3 from './burja-na-chernom-more/sounds/sea/sea.mp3';
import danajaAnimatedMp4 from './danaja/animated/animated.mp4';
import danajaAnimatedWebm from './danaja/animated/animated.webm';
import danajaPreview from './danaja/preview.webp';
import danajaSpeechIcon from './danaja/sounds/speech/speech.svg';
import danajaSpeechMp3 from './danaja/sounds/speech/speech.mp3';
import danajaMusicIcon from './danaja/sounds/music/music.svg';
import danajaMusicMp3 from './danaja/sounds/music/music.mp3';
import elochnyjTorgPreview from './elochnyj-torg/preview.webp';
import elochnyjTorgMagnifier from './elochnyj-torg/magnifier.gif';
import elochnyjTorgMusicIcon from './elochnyj-torg/sounds/music/music.svg';
import elochnyjTorgMusicMp3 from './elochnyj-torg/sounds/music/music.mp3';
import trojkaZimojPreview from './trojka-zimoj/preview.webp';
import vozvrashhenieSLovliMulejPreview from './vozvrashhenie-s-lovli-mulej/preview.webp';
import zhenyIzdaliSmotrjashhieNaGolgofuPreview from './zheny-izdali-smotrjashhie-na-golgofu/preview.webp';

const pictures = [
  {
    id: 'burja-na-chernom-more',
    name: '«Буря на Чёрном море»',
    authorAndYear: 'Айвазовский И.К. 1873 г.',
    descriptionParagraphs: [
      `В бурях И.К. Айвазовский видел мощь и завораживающую красоту, поэтому его произведения
      посвящены водной стихии, которую он изображал во множестве настроений. Метод его работы
      определили феноменальная память и богатое воображение: он почти не писал с натуры,
      работая исключительно в мастерской.`,
      `Цветовое решение марины «Буря на Чёрном море» построено на тонко разработанной гамме
      холодных серо-зеленых тонов. Особая виртуозность и артистичность проявляется в ритме
      распределения тонких и корпусных слоев краски, в динамике и форме мазка, в красоте и
      сложности фактурных решений, в энергии световых акцентов.`,
      `Известно, что в 1844 году Айвазовский пережил бурю в Бискайском заливе, которая наложила
      отпечаток на его творчество. Шторм был так силен, что судно считали затонувшим, о чем
      писали в газетах Европы и Петербурга. Так, в данной картине чувствуется страх,
      перенесенный когда-то самим художником.`,
    ],
    preview: burjaNaChernomMorePreview,
    animatedMp4: burjaNaChernomMoreAnimatedMp4,
    animatedWebm: burjaNaChernomMoreAnimatedWebm,
    sounds: [
      {
        name: 'Озвучка',
        icon: burjaNaChernomMoreSpeechIcon,
        mp3: burjaNaChernomMoreSpeechMp3,
      },
      {
        name: 'Музыка',
        icon: burjaNaChernomMoreMusicIcon,
        mp3: burjaNaChernomMoreMusicMp3,
      },
      {
        name: 'Звуки моря',
        icon: burjaNaChernomMoreSeaIcon,
        mp3: burjaNaChernomMoreSeaMp3,
      },
    ],
  },
  {
    id: 'danaja',
    name: '«Даная»',
    authorAndYear:
      'Копия с картины Харменса ван Рейна Рембрандта. Неизвестный русский художник XIX века',
    descriptionParagraphs: [
      `Поступило полотно из коллекции художественных картин иностранной школы
      Государственного Русского музея в 1927 году. Ранее оно хранилось в собрании
      Музея Императорской Академии художеств.`,
      `Данная картина – редкое произведение копийного характера, получившее широкую
      известность. В 1985 году подлинная «Даная» получила множественные повреждения
      в Государственном Эрмитаже. Эксперты долгое время искали что-то похожее на неё и нашли
      в Омске. В течение реставрации, на протяжении двенадцати лет, картина находилась
      в Санкт-Петербурге. Уже в 1997 году в Москве удалось показать возрождённый шедевр,
      а копия вернулась домой.`,
      `Даная – дочь Акрисия, легендарного царя Аргоса, и Эвридики (по другим источникам
      – Аганиппы). Акрисию пророчили смерть от собственного внука, поэтому царь запер
      свою дочь вместе с кормилицей в медное подземелье (по другой версии – в бронзовую
      башню), изолировав от внешнего мира. Однако, Зевс настолько был поражен красотой Данаи,
      что протёк в виде золотого дождя сквозь крышу и проник в лоно Данаи. От этого
      тайного союза родился Персей, который смертельно ранил своего деда.`,
    ],
    preview: danajaPreview,
    animatedMp4: danajaAnimatedMp4,
    animatedWebm: danajaAnimatedWebm,
    sounds: [
      {
        name: 'Озвучка',
        icon: danajaSpeechIcon,
        mp3: danajaSpeechMp3,
      },
      {
        name: 'Музыка',
        icon: danajaMusicIcon,
        mp3: danajaMusicMp3,
      },
    ],
  },
  {
    id: 'elochnyj-torg',
    name: '«Ёлочный торг»',
    authorAndYear: 'Манизер Г.М. 1910-е гг.',
    descriptionParagraphs: [
      `В собрании Омского областного музея изобразительных искусств имени М.А. Врубеля
      есть не только портреты, но и жанровые композиции кисти Генриха Манизера.`,
      `Настроение грядущей радости и ожидания праздника художник убедительно передает
      в жанровой картине «Ёлочный торг», на которой, согласно сведениям сына художника
      скульптора Матвея Манизера и внучки художника Н. Манизер, изображена
      рождественская ярмарка на Покровской площади в Санкт-Петербурге. Площадь получила
      свое название по стоявшей здесь церкви Покрова Пресвятой Богородицы. Вокруг храма
      ещё в начале XIX века возник толкучий рынок, сохранявший свое назначение до
      начала XX века. Здесь проходили и рождественские ярмарки. Покровская церковь была
      разобрана в 1920-х годах, а площадь полностью реконструировали. Был ликвидирован и
      толкучий рынок, на месте которого создан обширный и уютный сквер. Бывшая
      Покровская площадь переименована в площадь Тургенева.`,
      `Изо всех представленных работ Генриха Манизера эта, пожалуй, является самой
      атмосферной. Перед зрителем раскинулась городская площадь, на которой торговцы
      расположили лотки со всевозможными предпраздничными товарами, а центральное место
      занимает ёлочный базар. Интересно отметить, что работа осталась незавершенной. Это
      бросается в глаза даже при беглом осмотре: автор с невероятной тщательностью
      изображает городской пейзаж, зритель может даже разглядеть вывески «Трактир
      Ярославль» и «Бюро ритуальных услуг», однако лица на переднем плане остались
      не прописаны. Художник-академист не мог позволить себе такую вольность намеренно.
      Причины прекращения Г.М. Манизером работы над полотном остаются неизвестными.`,
    ],
    preview: elochnyjTorgPreview,
    magnifier: elochnyjTorgMagnifier,
    sounds: [
      {
        name: 'Музыка',
        icon: elochnyjTorgMusicIcon,
        mp3: elochnyjTorgMusicMp3,
      },
    ],
  },
  {
    id: 'trojka-zimoj',
    name: '«Тройка зимой»',
    authorAndYear: 'Сверчков Н.Е. 1888 г.',
    descriptionParagraphs: [
      `Николай Егорович Сверчков (1817-1898) − русский художник-живописец, мастер
      анималистической, батальной и жанровой живописи.`,
      `Тройка Сверчкова бежит по необозримым просторам России, которая славится
      глубокими сугробами и жестокими буранами. Картина вселяет ужас в душу,
      становится холодно и зябко при одном только взгляде на человека,
      направляющего лошадей.`,
      `Сверчков умел правдиво и свободно изображать сцены с лошадьми. Именно это
      и помогло Сверчкову занять место художника Хреновского и Чесменского
      государственных конных заводов, являющихся крупнейшими в России. В этой
      должности он создал целую галерею, представляющую породистых лошадей.`,
    ],
    preview: trojkaZimojPreview,
  },
  {
    id: 'vozvrashhenie-s-lovli-mulej',
    name: '«Возвращение с ловли мулей»',
    authorAndYear: 'Кившенко А.Д. 1881 г.',
    descriptionParagraphs: [
      `Алексей Данилович Кившенко (1851-1895) – академик, профессор Императорской
      Академии художеств, живописец, изображавший бытовые, охотничьи и батальные
      сцены. Известность среди широких масс получил после обучения в Европе. Самое
      узнаваемое полотно – «Возвращение с ловли мулей» – написано в Нормандии.
      Картина изображает сборщиков мидий после отлива и выстроена в соответствии
      со строгой композицией с глубоким пространством. На переднем плане – своеобразие
      северного пейзажа с холодными замшелыми камнями. Чувствуется здесь и психологизм
      персонажей. В корзинах они несут мидии, или мули. Сбор морских ракушек – одно из
      важных занятий нормандцев.`,
      `Известно, что картина хранилась в фонде Омского музея им. Врубеля. Она стала
      доступна зрителю после реставрации в 2007 году.`,
    ],
    preview: vozvrashhenieSLovliMulejPreview,
  },
  {
    id: 'zheny-izdali-smotrjashhie-na-golgofu',
    name: '«Жёны, издали смотрящие на Голгофу»',
    authorAndYear: 'Боткин М.П. 1867 г.',
    descriptionParagraphs: [
      `М.П. Боткин – академик исторической живописи, гравер, коллекционер,
      искусствовед и археолог. Был верен канонам академической живописи,
      то есть утверждал возвышенные и благородные образы библейской истории
      и античности.`,
      `Картина «Жёны, издали смотрящие на Голгофу» создана в Риме в 1867 году.
      Она посвящена распятию Иисуса Христа на горе Голгофе близ Иерусалима.
      Художник передает состояние глубокой скорби, охватившей людей. Скорбь,
      отчаяние, любовь и преданность передается через состояние женщин,
      сопровождавших Иисуса во время его земного служения. В белом одеянии,
      по мнению евангелистов, изображена Мария Магдалина, которая приравнена
      к апостолам.`,
      `В конце 60-х годов XIX века работа экспонировалась в залах Петербургской
      Академии художеств и затем хранилась в мастерской Боткина. В 1925 году
      дочь художника Е.М. Боткина передала в дар Омскому музею девять произведений
      отца, среди которых находилась картина «Жёны, издали смотрящие на Голгофу».`,
    ],
    preview: zhenyIzdaliSmotrjashhieNaGolgofuPreview,
  },
];

export default pictures;
